cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "tomanthony/brews"

brew "direnv"
brew "docker"
brew "fish"
brew "fish"
brew "gh"
brew "jq"
brew "mas"
brew "mercurial"
brew "node"
brew "openapi-generator"
brew "pandoc"
brew "pipenv"
brew "poetry"
brew "postgresql", restart_service: true
brew "pyenv"
brew "tmux"
brew "tree"
brew "yarn"

cask "font-menlo-for-powerline"
cask "google-cloud-sdk"
cask "iterm2"
cask "zoom"

mas "Evernote Web Clipper", id: 1481669779
mas "HiddenMe", id: 467040476
mas "Kindle", id: 405399194
mas "Markoff", id: 1084713122
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "WinArchiver Lite", id: 414855915
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
mas "iReal Pro", id: 409035833
